/* ------------------------------------------------------------
 ' FormController
 ' ------------------------------------------------------------
 ' Отвечает за кнопки Сохранить(onSaveBtn) и Отмена(onCancelBtn
 ' ------------------------------------------------------------
 */

Ext.define('MyApp.controller.FormController', {
      extend: 'Ext.app.ViewController',
      alias: 'controller.FormController',
      /* ------------------------------------------------------------
       * onSaveBtn - метод сохранения
       * ------------------------------------------------------------
       * Используется как при сохранении нового, так и при редактировании 
       * старого объявления. Сначала мы получаем форму из окна, и если
       * эта форма валидна, то достаем из нее Запись и проверяем ее
       * фантомность. Если она новая, то вписываем в нее значения
       * полей формы, а затем сохраняем в хранилище(нужное нам
       * хранилище достается в зависимости от используемой
       * модели записи). Если же запись не новая, то за-
       * пускаем апдейтРекорд формы. Закрываем окно
       * ------------------------------------------------------------
       */
      onSaveBtn: function (button) {
            var store;
            var form = button.up('window').down('form');

            if (form.isValid()) {
                  var record = form.getRecord();

                  if (record.phantom)
                  {
                        record.set(form.getValues());
                        if (record.entityName === 'MyApp.model.Ad') {
                              store = this.getStore('ads');
                        } else if (record.entityName === 'MyApp.model.Author') {
                              store = this.getStore('authors');
                        }
                        store.insert(0, record);

                  } else {
                        form.updateRecord();
                  }

                  button.up('window').destroy();
            }
                    /* ------------------------------------------------------------
                     * onCancelBtn
                     * ------------------------------------------------------------
                     * Используется при нажатии на кнопку Отмена в наших формах
                     * ------------------------------------------------------------
                     */
      },
      onCancelBtn: function (button) {
            button.up('window').destroy();
      }

});


